spec/fixtures/vcr_cassettes/CloudPayments_RecurrentChargeBalance/_call/w/_banking_errors_InvalidToken_/must_raise_CloudPaymentsError.yml

---
http_interactions:
- request:
    method: post
    uri: https://test_api_00000000000000000000001:test_api_00000000000000000000001@api.cloudpayments.ru/payments/tokens/charge
    body:
      encoding: UTF-8
      string: '{"Amount":50,"Currency":"RUB","AccountId":"4f7422c1","Token":"ABBEF19476623CA56C17DA75FD57734DBF82530686043A6E491C6D71BEFE8F6E"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - application/json; charset=utf-8
      Server:
      - Microsoft-IIS/8.5
      X-Aspnetmvc-Version:
      - '5.2'
      X-Aspnet-Version:
      - 4.0.30319
      Date:
      - Tue, 05 Apr 2016 07:41:50 GMT
      Content-Length:
      - '43'
    body:
      encoding: UTF-8
      string: '{"Success":false,"Message":"Invalid token"}'
    http_version:
  recorded_at: Tue, 05 Apr 2016 07:43:47 GMT
recorded_with: VCR 3.0.1
